{
  "timestamp": 1742001373,
  "papers": [
    {
      "title": "Provable Robust Overfitting Mitigation in Wasserstein Distributionally\n  Robust Optimization",
      "authors": [
        "Shuang Liu",
        "Yihan Wang",
        "Yifan Zhu",
        "Yibo Miao",
        "Xiao-Shan Gao"
      ],
      "abstract": "Wasserstein distributionally robust optimization (WDRO) optimizes against\nworst-case distributional shifts within a specified uncertainty set, leading to\nenhanced generalization on unseen adversarial examples, compared to standard\nadversarial training which focuses on pointwise adversarial perturbations.\nHowever, WDRO still suffers fundamentally from the robust overfitting problem,\nas it does not consider statistical error. We address this gap by proposing a\nnovel robust optimization framework under a new uncertainty set for adversarial\nnoise via Wasserstein distance and statistical error via Kullback-Leibler\ndivergence, called the Statistically Robust WDRO. We establish a robust\ngeneralization bound for the new optimization framework, implying that\nout-of-distribution adversarial performance is at least as good as the\nstatistically robust training loss with high probability. Furthermore, we\nderive conditions under which Stackelberg and Nash equilibria exist between the\nlearner and the adversary, giving an optimal robust model in certain sense.\nFinally, through extensive experiments, we demonstrate that our method\nsignificantly mitigates robust overfitting and enhances robustness within the\nframework of WDRO.",
      "published": "March 06, 2025",
      "categories": [
        "cs.LG",
        "cs.AI",
        "math.ST",
        "stat.TH"
      ],
      "pdf_link": "http://arxiv.org/pdf/2503.04315v1",
      "arxiv_url": "http://arxiv.org/abs/2503.04315v1"
    },
    {
      "title": "The Distributionally Robust Optimization Model of Sparse Principal\n  Component Analysis",
      "authors": [
        "Lei Wang",
        "Xin Liu",
        "Xiaojun Chen"
      ],
      "abstract": "We consider sparse principal component analysis (PCA) under a stochastic\nsetting where the underlying probability distribution of the random parameter\nis uncertain. This problem is formulated as a distributionally robust\noptimization (DRO) model based on a constructive approach to capturing\nuncertainty in the covariance matrix, which constitutes a nonsmooth constrained\nmin-max optimization problem. We further prove that the inner maximization\nproblem admits a closed-form solution, reformulating the original DRO model\ninto an equivalent minimization problem on the Stiefel manifold. This\ntransformation leads to a Riemannian optimization problem with intricate\nnonsmooth terms, a challenging formulation beyond the reach of existing\nalgorithms. To address this issue, we devise an efficient smoothing manifold\nproximal gradient algorithm. We prove the Riemannian gradient consistency and\nglobal convergence of our algorithm to a stationary point of the nonsmooth\nminimization problem. Moreover, we establish the iteration complexity of our\nalgorithm. Finally, numerical experiments are conducted to validate the\neffectiveness and scalability of our algorithm, as well as to highlight the\nnecessity and rationality of adopting the DRO model for sparse PCA.",
      "published": "March 04, 2025",
      "categories": [
        "math.OC",
        "cs.LG",
        "stat.ML"
      ],
      "pdf_link": "http://arxiv.org/pdf/2503.02494v1",
      "arxiv_url": "http://arxiv.org/abs/2503.02494v1"
    },
    {
      "title": "Diagnosis of Patients with Viral, Bacterial, and Non-Pneumonia Based on\n  Chest X-Ray Images Using Convolutional Neural Networks",
      "authors": [
        "Carlos Arizmendi",
        "Jorge Pinto",
        "Alejandro Arboleda",
        "Hernando González"
      ],
      "abstract": "According to the World Health Organization (WHO), pneumonia is a disease that\ncauses a significant number of deaths each year. In response to this issue, the\ndevelopment of a decision support system for the classification of patients\ninto those without pneumonia and those with viral or bacterial pneumonia is\nproposed. This is achieved by implementing transfer learning (TL) using\npre-trained convolutional neural network (CNN) models on chest x-ray (CXR)\nimages. The system is further enhanced by integrating Relief and Chi-square\nmethods as dimensionality reduction techniques, along with support vector\nmachines (SVM) for classification. The performance of a series of experiments\nwas evaluated to build a model capable of distinguishing between patients\nwithout pneumonia and those with viral or bacterial pneumonia. The obtained\nresults include an accuracy of 91.02%, precision of 97.73%, recall of 98.03%,\nand an F1 Score of 97.88% for discriminating between patients without pneumonia\nand those with pneumonia. In addition, accuracy of 93.66%, precision of 94.26%,\nrecall of 92.66%, and an F1 Score of 93.45% were achieved for discriminating\nbetween patients with viral pneumonia and those with bacterial pneumonia.",
      "published": "March 03, 2025",
      "categories": [
        "eess.IV",
        "cs.CV",
        "cs.LG",
        "stat.CO"
      ],
      "pdf_link": "http://arxiv.org/pdf/2503.02906v1",
      "arxiv_url": "http://arxiv.org/abs/2503.02906v1"
    }
  ]
}