{
  "timestamp": 1757208244,
  "papers": [
    {
      "title": "Speech transformer models for extracting information from baby cries",
      "authors": [
        "Guillem Bonafos",
        "Jéremy Rouch",
        "Lény Lego",
        "David Reby",
        "Hugues Patural",
        "Nicolas Mathevon",
        "Rémy Emonet"
      ],
      "abstract": "Transfer learning using latent representations from pre-trained speech models\nachieves outstanding performance in tasks where labeled data is scarce.\nHowever, their applicability to non-speech data and the specific acoustic\nproperties encoded in these representations remain largely unexplored. In this\nstudy, we investigate both aspects. We evaluate five pre-trained speech models\non eight baby cries datasets, encompassing 115 hours of audio from 960 babies.\nFor each dataset, we assess the latent representations of each model across all\navailable classification tasks. Our results demonstrate that the latent\nrepresentations of these models can effectively classify human baby cries and\nencode key information related to vocal source instability and identity of the\ncrying baby. In addition, a comparison of the architectures and training\nstrategies of these models offers valuable insights for the design of future\nmodels tailored to similar tasks, such as emotion detection.",
      "published": "September 02, 2025",
      "categories": [
        "cs.SD",
        "cs.LG",
        "stat.AP"
      ],
      "pdf_link": "http://arxiv.org/pdf/2509.02259v1",
      "arxiv_url": "http://arxiv.org/abs/2509.02259v1"
    },
    {
      "title": "Transfer Learning for Classification under Decision Rule Drift with\n  Application to Optimal Individualized Treatment Rule Estimation",
      "authors": [
        "Xiaohan Wang",
        "Yang Ning"
      ],
      "abstract": "In this paper, we extend the transfer learning classification framework from\nregression function-based methods to decision rules. We propose a novel\nmethodology for modeling posterior drift through Bayes decision rules. By\nexploiting the geometric transformation of the Bayes decision boundary, our\nmethod reformulates the problem as a low-dimensional empirical risk\nminimization problem. Under mild regularity conditions, we establish the\nconsistency of our estimators and derive the risk bounds. Moreover, we\nillustrate the broad applicability of our method by adapting it to the\nestimation of optimal individualized treatment rules. Extensive simulation\nstudies and analyses of real-world data further demonstrate both superior\nperformance and robustness of our approach.",
      "published": "August 28, 2025",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.ST",
        "stat.ME",
        "stat.TH"
      ],
      "pdf_link": "http://arxiv.org/pdf/2508.20942v1",
      "arxiv_url": "http://arxiv.org/abs/2508.20942v1"
    },
    {
      "title": "A nonstationary spatial model of PM2.5 with localized transfer learning\n  from numerical model output",
      "authors": [
        "Wenlong Gong",
        "Brian J. Reich",
        "Joseph Guinness"
      ],
      "abstract": "Ambient air pollution measurements from regulatory monitoring networks are\nroutinely used to support epidemiologic studies and environmental policy\ndecision making. However, regulatory monitors are spatially sparse and\npreferentially located in areas with large populations. Numerical air pollution\nmodel output can be leveraged into the inference and prediction of air\npollution data combining with measurements from monitors. Nonstationary\ncovariance functions allow the model to adapt to spatial surfaces whose\nvariability changes with location like air pollution data. In the paper, we\nemploy localized covariance parameters learned from the numerical output model\nto knit together into a global nonstationary covariance, to incorporate in a\nfully Bayesian model. We model the nonstationary structure in a computationally\nefficient way to make the Bayesian model scalable.",
      "published": "August 21, 2025",
      "categories": [
        "stat.AP",
        "stat.CO",
        "stat.ME"
      ],
      "pdf_link": "http://arxiv.org/pdf/2508.15978v1",
      "arxiv_url": "http://arxiv.org/abs/2508.15978v1"
    }
  ]
}